OdRxDisplayAsAttribute.getDisplayValue(OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
By default this function dereferences the value and retrieves the property
which name is stored in the attribute.
\param value                [in]  Value to dereference and retrieve the property of.
\param useDynamicProperties [in]  Flag to optimize getting the displayed value.
It can be set to false only if all properties
of database objects are statically dependent
on the object type. Default value is true.
\returns
Name of the property of the dereferenced object to use instead of the object
ID. If the value type is not a reference or the referenced object has no
such property, returns an empty string.
\remarks
Can be overloaded in custom implementations.

OdRxDisplayAsAttribute.propertyName
\details
Retrieves the name of the property of the dereferenced object to use instead
of the object ID.
\returns
Name of the property of the dereferenced object to use instead of the object
ID.

OdRxDisplayAsAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor. Creates an attribute of the OdRxDisplayAsAttribute type.
\param property_name [in]  The name of the property of the dereferenced
object to use instead of the object ID.
\returns
Smart pointer to a constructed attribute object.